mefenemic-design-change/0/crys
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      crys;
}

dimensions      [0 0 0 0 0 0 0];
internalField   uniform 0; // Initial crystallinity

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0;
    }

    outlet
    {
        type            zeroGradient;
    }

    walls
    {
        type            zeroGradient;
    }
}
