mefenemic-design-change/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
	grad(s)			cellLimited Gauss linear 1;	
    grad(crys)			cellLimited Gauss linear 1;
    limited         cellLimited Gauss linear 1;
}

divSchemes
{
    default             none;

    div(phi,U)          Gauss linearUpwind limited;
    div(phi,s)          Gauss linearUpwind limited;
    div(phi,crys)          Gauss linearUpwind limited;
    div((nuEff*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
	laplacian(Ds,s) Gauss linear corrected;
    laplacian(Dc,crys) Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}


// ************************************************************************* //
